from itertools import count

print("Тест на знание ARK: Survival Evolved ")
print("Какое оружие самое эффективное для приручения существ?"),print("Варианты ответов: a) Лук, b) Арбалет, c) Длинноствольная винтовка ")
x = str(input("Введите правильный ответ "))
xa = 0
xb = 0
xc = 0
count = 0
if x == "a)" or x == "a" or x == "a) Лук" or x == "a) лук":
    print("Вы взяли лук"), print("Вы новичок?")
    xa = xa + 1
if x == "b)" or x == "b" or x == "b) Арбалет" or x == "b) арбалет" :
    print("Вы взяли арбалет"), print("А вы любитель!")
    xb = xb + 1
if x == "c)" or x == "c" or x == "c) длинноствольная винтовка" or x == "c) длинноствольная винтовка" :
    print("Вы взяли длинноствольную винтовку"), print("Сразу видно профи! + 1 бал")
    xc = xc + 1
    count = count + 1
if xa == 1:
    print("Какие снаряды ты возьмёшь"),print("Варианты ответов: a) Каменные стрелы, b) Транквилизирующие стрелы")
    xc1 = str(input("Введите правильный ответ "))
    if xc1 != "b) Транквилизирующие стрелы" or xc1 != "b) транквилизирующие стрелы" or xc1 != "b)" or xc1 != "b" :
        print("Ты приручать пошёл или убивать? Подумай ещё раз")
    else :
        print("Правильно это хороший тип снаряда для лука")
        xa = xa + 1
if xb == xb + 1 :
    print("Какие снаряды ты возьмёшь"), print("Варианты ответов: a) Каменные стрелы, b) Транквилизирующие стрелы")
    xb1 = str(input("Введите правильный ответ "))
    if xb1 == "a) Каменные стрелы" or "a) каменные стрелы" or "a)" or "a":
        print("Ты приручать пошёл или убивать? Подумай ещё раз")
        xb2 = str(input("Введите правильный ответ "))
        if xb2 == "b) Транквилизирующие стрелы" or xb2 == "b) транквилизирующие стрелы" or xb2 == "b)" or xb2 == "b":
            print("Правильно это лучший тип снаряда для арбалета")
            xb = xb + 1
    else :
        if xb1 == "b) Транквилизирующие стрелы" or xb1 == "b) транквилизирующие стрелы" or xb1 == "b)" or xb1 == "b":
            print("Правильно это лучший тип снаряда для арбалета")
            xb = xb + 1
if xc == 1 :
    print("Какие снаряды ты возьмёшь"), print("Варианты ответов: a) Пуля простой винтовки, b) Транквилизирующий дротик, с)Улучшенный транквилизирующий дротик ")
    xc1 = str(input("Введите правильный ответ "))
    if xc1 == "a) Пуля простой винтовки" or xc1 =="a) пуля простой винтовки" or xc1 == "a)" or xc1 == "a" :
        print("Ты приручать пошёл или убивать? Подумай ещё раз")
        xc2 = str(input("Введите правильный ответ "))
        if xc2 == "b) Транквилизирующие дротик" or xc2 == "b) транквилизирующие дротик" or xc2 == "b)" or xc2 == "b":
            print("Правильно это хороший тип снаряда для длинноствольной винтовки")
            xc = xc + 1
    else :
        if xc1 == "b) Транквилизирующие дротик" or xc1 == "b) транквилизирующие дротик" or xc1 == "b)" or xc1 == "b" :
            print("Правильно это хороший тип снаряда для длинноствольной винтовки")
            xc = xc + 1